# 1) შემოაყვანიეთ მომხმარებელს რაღაცა სიტყვა:
# -> შეამოწმეთ არის თუ არა 'a' ან 'A' ამ სიტყვაში/ტექსტში
# -> შეამოწმეთ თუ არ არის სიტყვა 'car' ამ სიტყვაში/ტექსტში


# num = input("please enter a words: ")
# if 'a' in num or 'A' in num:
#     print("ამ ტექსტში არის a,A")
# else:
#     print("ამ ტექსტში არ არის a,A")

# if 'car' not in num:
#     print("ამ ტექსტში'car' არ არის.")
# else:
#     print("ამ ტექსტში 'car' არ არის.")



# 2) მომხმარებელს შემოატანინეთ ტექსტი.
# -> დაუარეთ ამ ტექტის ასოებს for ლუპით
# -> თუ ასო არის 'a' ან 'A' დასკიპეთ, სხვა შემთხვევაში დაპრინტეთ ასო

ლოლ = input("შეიყვანე ტექსტი: ")

for ooo in ლოლ:
    if ooo == 'a' or ooo == 'A':
        continue
    print(ooo)

