# 1)მოცემულია სია --> [1, 2, 3, 4, 5, 6]
# შეცვალე შუა ორი ელემენტი რიცხვებით [10, 20, 30].
lis = [1, 2, 3, 4, 5, 6]
fi = [10, 20, 30]
lis[1:3] = fi
print(lis)
# 2)მოცემულია სია --> ["apple", "banana", "cherry", "kiwi", "mango"]
# შეცვალე პირველი ორი ელემენტი სიით ["pear", "plum"].
lus = ["apple", "banana", "cherry", "kiwi", "mango"]
sc = ["pear", "plum"]
lus[:2] = sc
print(lus)
# 3)ოცემულია სია --> ["a", "b", "c", "d", "e", "f"]
# შეცვალე ბოლო სამი ელემენტი სიით ["x", "y", "z"].
list = ["a", "b", "c", "d", "e", "f"]
tr = ["x", "y", "z"]
list[3:6] = tr
print(list)
# 4)მოცემულია სია --> ["red", "green", "blue", "yellow", "black", "white"]
# შეცვალე ინდექსებზე 2-დან 5-მდე ელემენტები სიით ["purple", "orange"].
lst = ["red", "green", "blue", "yellow", "black", "white"]
fo = ["purple", "orange"]
lst[2:6] = fo
print(lst)
# 5)მოცემულია სია --> ["გიორგი" , "ირმა" , "საბა" ]
# შეცვალე მთლიანი სია შემდეგი სიით -->  ["red", "green", "blue", "yellow", "black", "white"]
lts = ["გიორგი" , "ირმა" , "საბა" ]
fi = ["red", "green", "blue", "yellow", "black", "white"]
lts[:] = fi
print(lts)
# ===========================================

# 6) მომხმარებელმა შეიყვანოს რიცხვი — შეამოწმე ლუწია თუ კენტი ეს რიცხვი , თუ ლუწია დაპრინტე --> "Even" ,თუ კენტია დაპრინტე --> "Odd".
# num = int(input("please enter ur number:  "))

# if num % 2 == 0:
#     print("EVEN")
# else:
#     print("ODD")


# 7)შექმენი სია --> სადაც შეინახავ ინტეჯერებს ,შემდეგ შეამოწმე თუ სიაში მყოფი მე3 ინდექსზე მდგომი ელემენტი არუს ლუწი დაპრინტე --> "Even number" ,თუ სიაში მყოფი მესამე ინდექსზე მდგომი ელემენტი არის კენტი დაპრინტე --> "Odd number"
# num = [10, 25, 32, 17, 44]

# sus = num[3]

# if sus % 2 == 0:
#     print("Even number")
# else:
#     print("Odd number")

# 8)შექმენი სია სადაც შეინახავ ინტეჯერებს, თუ სიაში მყოფი ბოლო ელემენტი არის ლუწი და მეტი 50 ზე დაპრინტე --> "ეს რიცხვი არის ლუწი და მეტი 50 ზე" , თუ რიცხვი არის კენტი და ნაკლებია 50 ზე დაპრინტე --> "ეს რიცხვი არის კენტი და ნაკლები 50 ზე"
num1 = [10, 25, 32, 17, 44]

ppp = num1[4]

if ppp % 2 == 0:
    print("this number is even and more then 50")
else:
    print("this number is odd and less then 50")
# 9)შექმენი სია სადაც შეინახავ ინტეჯერებს,თუ სიაში მყოფი მე 5 ინდექსზე მდგომი ელემენტი არის ლუწი ან 100 ზე მეტი დაუპრინტე --> "even or more than 100" ,თუ სიაში მყოფი მესამე ინდექსზე მდგომი ელემენტი არის კენტი ან ნაკლები 100 ზე დაუპრინტე --> odd or less than 100
num2 = [20, 30, 60, 80, 120, 140]

lll = num2[5]

if lll % 2 == 0:
    print("even or more than 100")
else:
    print("odd or less than 100")
# ==============================================================

# 10)შექმენი ორი ცვლადი სადაც შეინახავთ სტრინგებს , შემდეგ შეადარე უდრის თუ არა ეს ორი ცვლადი ერთმანეთს , გამოიყენე ახლად ნასწავლი ოპერატორი != 
name1 = "Dadu"
name2 = "Nika"

if name1 != name2:
    print("სტრინგები განსხვავდება")
else:
    print("სტრინგები ერთმანეთს ემთხვევა")
