# 1)კომენტარის სახით ჩამოწერე თითეული სიის ფუნქცია რაც ვისწავლეთ და მიუწერეთ გვერდით ახსნა განმარტება თუ რა გადაეცემა თითეულს და რას აკეთებს ის
# .append()-მოკლედ ამ კოდს შეუძლია რომ დავამატოთ რამე სიტყვა ან ციფრი სიაში
# .insert()-ამ თაგს შეუძლია დავამატოთ სიტყვა სადაც გვინდა სიაშ
# .pop()-ამ თაგს შეუძლია ამოშალოს ინდეხის დახმარებით ანუ რაიმე რაც მაგ.4 ინდქსზე დგას და იმ ინდეხს მისცემ ის ამოიშელბა
# .remove()-ამ თეგიძ შლის მაგრამ ამ თეგში ფრჩხილებში უნდა ჩწრი თვითონ სიტყვის სახელი რომ ამოიშალოს

# 2)შექმენი რიცხვების სია.
# append() ფუნქციით დაამატე მასში რიცხვი 10 ბოლოში.
# დაბეჭდე სია რომ ნახო ჩაემატა თუ არა
# lis = ["siyvaruli" , 20 , "silamaze" , 33]
# lis.append(10)
# print(lis)

# 3)შექმენი სახელების სია.
# append() ფუნქციით დაამატე შენი სახელი სიის ბოლოში
# დაბეჭდე სია.
# lis = ["siyvaruli" , 20 , "silamaze" , 33]
# lis.append("nika")
# print(lis)

# 4)შექმენი სია სადაც შეიყვან სახელებს,შენიდავალებაა მომხმარებელს შემოატანინო რაიმე სახელი და შეინახო ცვლადში,შემდეგ ჩაამატე append()ის დახმარებით სიის ბოლოში მომხმარებლის შემოტანილი სიტყვა ~
# დაბეჭდე სია რომნახო ჩაემატა თუ არა
# lis = ["saba", "nika", "luka", "dadu"]
# name = input("შეიტანოთ სახელი: ")
# lis.append(name)
# print(lis)


# 5)შექმენი სია სადაც შეიყვანთ 5 სახეკს
# .insert() დახმარებით სიაში ჩაამატე მესამე ინდექსზე შენი სახელი
# lis = ["saba", "irma", "luka", "dadu", "koste"]
# lis.insert(5, "Nika")
# print(lis)

# 6)მომხმარებელს შემოატანინე სახელი და რიცხვი(integer 0 იდან 6 ჩათვლით)
# შენი დავალებაა შექმნა სია მინიმუმ 6 ელემენტიანი
# insert() დახმარებით დაამატე სიაში მომხმარებლის მიერ შემოტანილი რიცხვი,მომხმარებლის მიერ შემოტანილ ინდექსზე
# მაგ:მომხმარებელმა სახელი შემოიტანა საბა და რიცხვი 4 , შენი დავალებაა რომ საბა დაამატო მეოთხე ინდექსზე(გამოიყენე ცვლადის სახელები იმიტომ რომ არ იცი მომხმარებელი რა მნშვნელობებს შემოიტანს
# დაბეჭდე სია რომ ნახო ჩაემატა თუ არა
# შექმნათ სია მინიმუმ 6 ელემენტით

# 7)შექმენი სია:
# fruits = ["apple", "banana"]
# fruits.insert(0 , "orange" )
# print(fruits)

# 8)შექმენი სია:
# names = ["goga", "saba", "luka"]
# names.insert(2 , "irakli")
# print(names)

# 9)შექმენი სია:
# foods = ["bread", "milk", "cheese"]
# foods.insert(0 , "water")
# print(foods)

# 10)შექმენი სია:
# numbers = [5, 10, 15]
# numbers.pop()
# print(numbers)

# 11)შექმენი სია:
# fruits = ["apple", "banana", "orange"]
# fruits.pop(1)
# print(fruits)

# 12)შექმენი სია:
# names = ["goga", "saba", "luka"]
# names.pop(1)
# print(names)

# 13)შექმენი სია:
# colors = ["red", "green", "blue" , "yellow" , "black" , "purple"]
# colors.pop(0)
# colors.pop(2)
# print(colors)

# 14)მომხმარებელს შემოტანინე რიცხვი(0 იდან 4 მდე და შეინახე ცვლადში
# შექმენი სია tems = ["pen", "pencil", "book", "eraser"] 
# pop ის დახმარებით სიიდან ამოშალე მომხმარებლის მიერ შემოტანილ რიცხვზე(ინდექსზე) მდგომი ელემენტი
# tems = ["pen", "pencil", "book", "eraser"] 
# nam = int(input("მითხარი ნომერი"))
# tems.pop(nam)
# print(tems)
# 15)შექმენი სია:
# fruits = ["apple", "banana", "orange"]
# fruits.remove("banana")
# print(fruits)

# 16)შექმენი სია:
# nums = [3, 5, 3, 7]
# nums.remove(3)
# print(nums)

# 17)შექმენი სია:
# colors = ["red", "blue", "green"]
# colors.remove("blue")
# print(colors)

# 18)შექმენი სია:
names = ["goga", "saba", "luka"]
m = input("შმოიყვანე სახელი")
names.remove(m)
print(names)

# მომხმარებელს შემოატანინე ამ სამიდან რომელიმე სახელი შეინახე ცვლადში და remove()-ით წაშალე მომხმარებლის შემოტანილი სახელი სიიდან.

# დაბეჭდე სია რომ გაიგო მართლა ამოიშალა თუ არა

# 19)შექმენი სია:

# items = ["pen", "pencil", "book", "pencil"]


# remove()-ით წაშალე "pencil" და დაბეჭდე დარჩენილი სია.
