# ** Level 36: **
# ```
# 1) მომხმარებელს შემოატანინეთ სიტყვა.  
# -> იტერაციით გაიარეთ თითო ასო  
# -> თუ შეხვდებით ასო 'e'-ს ან 'E'-ს გაჩერდით (break)  
# -> დაბეჭდეთ მხოლოდ ის ასოები, რაც მანამდე იყო  

# www = input("შემოიტანეთ ტექსტი: ")
# for i in www:
#     if i == 'e' or i == 'E':
#         break


# 2) მომხმარებელს შემოატანინეთ წინადადება.  
# -> შეამოწმეთ არის თუ არა ტექსტში სიტყვა 'bad'  
# -> თუ არის, დაპრინტეთ "აკრძალული სიტყვა!"  
# -> თუ არაა, დაპრინტეთ "ყველაფერი რიგზეა"  

# lll = input("რამე თქვი: ")
# if "bed" in lll:
#     print("ცუდი სიტყვა!")
# else:
#     print("კარგი სიტყვა")

# 3) მომხმარებელს შემოატანინეთ წინადადება.  
# -> დაუარეთ ტექსტს for ციკლით  
# -> გამოტოვეთ ყველა space => ' '
# -> დაბეჭდეთ ყველა დანარჩენი სიმბოლო  


# xxx = input("შემოიტანეთ ტექსტი: ")
# for i in xxx:
#     if i != ' ':
#         continue
#     print(i)

# 4) მომხმარებელს შემოატანინეთ წინადადება.  
# -> დაუარეთ მას for ლუპით  
# -> გამოტოვეთ ხმოვნები (a, e, i, o, u)  
# -> დაბეჭდეთ მხოლოდ თანხმოვნები და თავისთავათ ყველა სხვა სიმბოლო 

# ttt = input("შემოიტანეთ წინადადება: ")
# lool = "AEIOUaeiou"
# for i in ttt:
#     if i not in lool:
#         continue
#     print(i)

# 5) მომხმარებელს შემოაყვანით ორი რიცხვი
# --> დაუარეთ ყველა რიცვს ამ დიაპაზონში
# --> დაბეჭდეთ მხოლოდ რიგით პირველი რიცხვი ამ შუალედში რომელიც იყოფა 15-ზე(შეწყვიტეთ ციკლი თუ არის ეგეთი)


# aq = int(input("შემოიტანეთ პირველი რიცხვი: "))
# iq = int(input("შემოიტანეთ მეორე რიცხვი: "))
# for i in range(aq, iq+1):
#     if i % 15 == 0:
#         print(i)
#         break

# 6) შექმენით უსასრულო while loop:
# --> სანამ მომხმარებელი არ შემოიყვანს 'python is best', მანამდე დაპრინტეთ 'you should learn python'


# while True:
#     num = input("თქვენი შეტყობინება: ")
#     if num == "python is best":
#         break
#     print("you should learn python")


# 7) \<.BOSS.>/ 
# მომხმარებელს შემოაყვანით ორი რიცხვი
# --> დაუარეთ ყველა რიცვს ამ დიაპაზონში
# --> დაბეჭდეთ მხოლოდ რიგით მესამე რიცხვი ამ შუალედში რომელიც იყოფა 3-ზე(შეწყვიტეთ ციკლი თუ არის ეგეთი)
# ```


