// ```
// 1) — რიცხვები 1-დან 20-მდე
// for ციკლის გამოყენებით დაბეჭდე რიცხვები 1-დან 20-ის ჩათვლით.

// for(let i = 0; i < 20;i++){
//     console.log(i)
// }


// 2)დაბეჭდე რიცხვები 20-დან 1-მდე კლებადობით.

// for(let i = 20; i > 0;i--){
//     console.log(i)
// }


// 3)გამოიტანე ლუწი რიცხვები 50 დან 100 მდე

// for(let i = 50; i < 100;i++){
//     if(i % 2 == 0){
//         console.log(i)
//     }
// }


// 4)რიცხვების ჯამი
// გამოთვალე რიცხვების ჯამი 1-დან 100-ის ჩათვლით.

// let sum = 0
// for(let i = 1; i < 101;i++){
//     sum += i
// }
// console.log(sum)

// 5) — კონკრეტული რიცხვის გამრავლების ტაბულა
// მომხმარებელს prompt()-ით შეაყვანინე რიცხვი და for ციკლის გამოყენებით დაბეჭდე მისი 
// გამრავლების ტაბულა 1-დან 10-ის ჩათვლით.

// მაგალითად, თუ მომხმარებელი შეიყვანს 5-ს, შედეგი უნდა იყოს:
// 5 x 1 = 5
// 5 x 2 = 10
// 5 x 3 = 15
// ...
// 5 x 10 = 50
// ```

// let num = Number(prompt("enter number"))
// for(let i = 1; i < 10; i++){
//     console.log(num + " x " + i + " = " + (num * i))
// }


// 6)გამოიტანე კენტი რიცხვები 30 დან 50 მდე 

// for(let i = 30; i < 50;i++){
//     if(i % 2 != 0){
//         console.log(i)
//     }
// }

// 7)გამოიტანე რიცხვები უკუსვლით 100 დან 20 მდე 3 სტეპის გამოტოვებით

// for(let i = 100; i > 20;i-=3){
//     console.log(i)
// }


// 8)let start = 15;
// let end = 85;

// for ციკლის გამოყენებით:
// 1. დაითვალე, რამდენი რიცხვია მოცემულ შუალედში.
// 2. დაითვალე, რამდენი რიცხვია 3-ის ჯერადი.
// 3. დაითვალე, რამდენი რიცხვია ერთდროულად 3-ისა და 5-ის ჯერადი.

// let start = 15
// let end = 85

// for(let i = start; i < end; i ++){
//     if(i%3 === 0 && i % 5 === 0){
//         console.log(i)
//     }
// }


// 9)let start = -20;
// let end = 30;

// for ციკლისა და if/else-ის გამოყენებით:
// 1. დაითვალე დადებითი რიცხვები.
// 2. დაითვალე უარყოფითი რიცხვები.
// 3. დაითვალე ლუწი რიცხვები.
// 4. გამოთვალე ყველა რიცხვის ჯამი.

// let start = -20
// let end = 30
// let sum = 0

// for(i = start; i < end; i++){
//     if(i > 0){
//         console.log("dadebiti:", i)
//     }else if (i < 0) {
//         console.log("uaryofiti:", i)
//     }

//     if(i % 2 == 0){
//         console.log("luwi:" , i)
//     }

//     sum += i
// }
// console.log(sum)