// 1)მომხმარებელს prompt()-ით შეაყვანინე ასაკი.
// თუ ასაკი 18 ან მეტია, გამოიტანე „სრულწლოვანი ხარ“.
// თუ ასაკი 18-ზე ნაკლებია, გამოიტანე „არასრულწლოვანი ხარ“.
// თუ შეყვანილი ასაკი უარყოფითია, გამოიტანე „არასწორი ასაკი“.

let age = prompt("enter age:")
if (age > 18) {
    console.log("სრულწლოვანი ხარ")
} else if (age < 18) {
    console.log("არასრულწლოვანი ხარ")
} else {
    console.log("არასწორი ასაკი")
}

// 2)მომხმარებელს შეაყვანინე პაროლი.
// გამოიყენე trim(), რათა პაროლს დასაწყისში და ბოლოში არსებული გამოტოვებები მოაშორო.
// თუ პაროლი არის "javascript123", გამოიტანე „სწორი პაროლია“.
// თუ პაროლი ცარიელია, გამოიტანე „პაროლი არ შეგიყვანია“.
// სხვა შემთხვევაში გამოიტანე „არასწორი პაროლი“.
pas = "javascript123"
let pass = prompt("please enter passcode:           ".trim())
if (pass == pas) {
    console.log("სწორი პაროლია")
} else if(pass != " "){
    console.log("პაროლი არ შეგიყვანია")
}else {
    console.log("არასწორი პაროლი")
}

// 3)რიცხვის კატეგორია
// მომხმარებელს შეაყვანინე რიცხვი.
// თუ რიცხვი დადებითია, გამოიტანე „დადებითი“.
// თუ რიცხვი უარყოფითია, გამოიტანე „უარყოფითი“.
// თუ რიცხვი ნულის ტოლია, გამოიტანე „ნული“.

let num = prompt("please enter num: ")
if(num >)

// 4)მომხმარებელს შეაყვანინე სახელი.

// გამოიყენე trim(), რათა ზედმეტი გამოტოვებები მოაშორო.

// გამოიყენე toLowerCase(), რათა სახელი პატარა ასოებით მიიღო.

// თუ სახელი "goga"-ს უდრის, გამოიტანე „გამარჯობა, გოგა!“.

// თუ სახელი "admin"-ია, გამოიტანე „მოგესალმები ადმინისტრატორო!“.

// სხვა შემთხვევაში გამოიტანე „მომხმარებელი ვერ მოიძებნა“.

// 5)მომხმარებელს შეაყვანინე ელფოსტის მისამართი.

// გამოიყენე trim() და toLowerCase().

// თუ მისამართი "admin@gmail.com"-ის ტოლია, გამოიტანე „ადმინისტრატორის ანგარიში“.

// თუ მისამართი მთავრდება "@gmail.com"-ით, გამოიტანე „Gmail-ის მომხმარებელი“.

// თუ მისამართი მთავრდება "@outlook.com"-ით, გამოიტანე „Outlook-ის მომხმარებელი“.

// სხვა შემთხვევაში გამოიტანე „უცნობი ელფოსტის მისამართი“.

// გამოიყენე endsWith() და შედარების ოპერატორები.

// 6)მომხმარებელს შეაყვანინე მომხმარებლის სახელი.

// მოაშორე ზედმეტი გამოტოვებები trim()-ით.

// თუ სახელი ცარიელია, გამოიტანე „სახელი აუცილებელია“.

// თუ სახელი 3 სიმბოლოზე ნაკლებია, გამოიტანე „სახელი ძალიან მოკლეა“.

// თუ სახელი 12 სიმბოლოზე მეტია, გამოიტანე „სახელი ძალიან გრძელია“.

// თუ სახელი "admin"-ით იწყება, გამოიტანე „ადმინისტრატორის სახელის გამოყენება აკრძალულია“.

// სხვა შემთხვევაში გამოიტანე „მომხმარებლის სახელი მიღებულია“.