# 1)მომხმარებელს შემოაყვანინეთ სახელი,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ დიდი ასოებით

# input = input("შემოიყვანე სახელი:  ")
# print(input.upper())

# 2)მომხმარებელს შემოაყვანინეთ სახელი დიდი ასოებით,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ პატარა ასოებით
# n = input("შეიყვანეთ სახელი დიდი ასოებით: ")
# print(n.lower())

# 3)მომხმარებელს შემოაყვანინეთ სახელი პატარა ასოებით,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ პირველი ასო იყოს დიდი
# na = input("შეიყვანეთ სახელი პატარა ასოებით: ")
# print(na.capitalize())

# 4)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები პატარა ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ დიდი ასოებით
# nam = ["nika", "gio", "davit"]
# for i in nam:
#     print(i.upper())

# 5)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები დიდი ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ პატარა ასოებით
# nam = ["NIKA", "GIO", "DAVIT"]
# for i in nam:
#     print(i.lower())
# 6)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები პატარა ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ პირველი ასო დიდიქონდეს
# nam = ["nika", "gio", "davit"]
# for i in nam:
#     print(i.capitalize())
# 7)შექმენი სია სადაც მოათავსებ ელემენტებს,თქვენი დავალებაა რომ ტერმინალში დაპრინტოთ თუ რამდენი ელემენტისგან შედგება ეს სია,გამოიყენეთ ნასწავლი ფუნქცია რომელიც პოულობდა სიის სიგრძეს
# lis = ["BMW", "Merc", "Bugatti", "Lamborgini"]
# i = len(lis)
# print(i)
# 8)შექმენი სტრინგი --> ალექსანდრე ,თქვენი დავალებაა რომ ტერმინალში დაპრინტოთ თუ რამდენი ასოსგან შედგება ეს სტრინგი,გამოიყენეთ ნასწავლი ფუნქცია რომელიც პოულობდა სტრინგის სიგრძეს
# i = "ალექსანდრე"
# g = len(i)
# print(g)
# 9)შექმენით სია სადაც მოათავსებთ მხოლოდ რიცხვებს,თქვენი დავალებაა რომ გაიგოთ ამ სიაში მყოფი ლუწი რიცხვების რაოდნობა
# lis = [1,2,3,4,5,6,7,8]
# aa = 0
# for i in lis:
#  if i % 2 == 0:
#     print("ეს ლუჭია")
# 10)შექმენით სია სადაც მოათავსებთ მხოლოდ რიცხვებს,თქვენი დავალებაა რომ გაიგოთ ამ სიაში მყოფი კენტი რიცხვების რაოდნობა
# lis = [1,2,3,4,5,6,7,8]
# aa = 0
# for i in lis:
#     if i % 2 == 0:
#         print("ეს კენტია")
# 11)მომხმარებელს შემოაყვანინე ორი რიცხვი start , end და step , თქვენი დავალებაა დაატრიალოთ ფორ ციკლი start იდან end ამდე და სტეპი იყოს step,ამ დიაპაზონში გამოიტანეთ ტერმინალში მხოლოდ ლუწი რიცხვები

start = int(input("შემოიყვანე დასაწყისი:  "))
end = int(input("შემოიყვანე დასასრული:  "))
step = int(input("შემოიყვანე ნაბიჯი:  "))

for i in range(start, end, step):
    if i % 2 == 0:
        print(i)