# 1) for ციკლით დაბეჭდე რიცხვები 1 დან 50 მდე.  
#    თუ რიცხვი ლუწია -> დაბეჭდე "ლუწი"
#    თუ კენტია -> "კენტი"  
#    ფორმატით:  
#    1 კენტია  
#    2 ლუწია
for i in range(1, 51):
    if i % 2 == 0:
        print(f"{i} ლუწია")
    else:
        print(f"{i} კენტია")
# 2) for ციკლით დაბეჭდე რიცხვები 0 დან 20 მდე.  
#    - თუ რიცხვი იყოფა 3-ზე -> "იყოფა 3-ზე"  
#    - თუ რიცხვი იყოფა 5-ზე -> "იყოფა 5-ზე"  
#    - თუ ორივეზე იყოფა -> "იყოფა 3-ზე და 5-ზე" 
#    - სხვაგვარად -> "არ იყოფა არცერთზე"
for i in range(21):
    if i % 3 == 0 and i % 5 == 0:
        print(f"{i} იყოფა 3-ზე და 5-ზე")
    elif i % 3 == 0:
        print(f"{i} იყოფა 3-ზე")
    elif i % 5 == 0:
        print(f"{i} იყოფა 5-ზე")
    else:
        print(f"{i} არ იყოფა არცერთზე")
# 3) მომხმარებელს შემოატანინე რიცხვი. 
#    for ციკლით დაითვალე რამდენი ლუწი და რამდენი კენტი რიცხვია დიაპაზონში 0-დან შემოტანილ რიცხვამდე.  
#    დაბეჭდე შედეგი ამ ფორმატით:  
#    ლუწი რიცხვების რაოდენობა: X  
#    კენტი რიცხვების რაოდენობა: Y
user_input = int(input("შეიყვანეთ რიცხვი: "))
even_count = 0 
odd_count = 0
for i in range(user_input + 1):
    if i % 2 == 0:
        even_count += 1
    else:
        odd_count += 1
print(f"ლუწი რიცხვების რაოდენობა: {even_count}")
print(f"კენტი რიცხვების რაოდენობა: {odd_count}")
# 4) მოცემულია სია -> [10, 25, 33, 47, 80, 99]  
#    for ციკლით დაუარე თითოეულ ელემენტს.  
#    თუ ელემენტი მეტია 50 ზე -> "მეტი 50-ზე" 
#    თუ ნაკლებია 50 ზე -> "ნაკლები 50-ზე".
numbers = [10, 25, 33, 47, 80, 99]
for number in numbers:
    if number > 50:
        print(f"{number} მეტი 50-ზე")
    else:
        print(f"{number} ნაკლები 50-ზე")
# 5) for ციკლით დაბეჭდე ყველა ლუწი რიცხვი 0 დან 100 მდე.  
#    ბოლოს დაბეჭდე -> "ლუწი რიცხვების ჯამია: X".
even_sum = 0
for i in range(101):    
    if i % 2 == 0:
        print(i)
        even_sum += i
# 6) შექმენი სია და შეინახეთ შიგნით სტრინგები  
#    for ციკლით დაბეჭდე მხოლოდ ის სიტყვები, რომლებიც იწყება ასო "a" ზე.
words = ["apple", "banana", "avocado", "grape", "apricot"]
for word in words:
    if word.startswith('a'):
        print(word)
# 7) for ციკლით დაბეჭდე რიცხვები 0 დან 20 მდე.  
#    თუ რიცხვი არის ნული -> "ნულია"  
#    თუ კენტია -> "კენტია"  
#    თუ ლუწია -> "ლუწია".
for i in range(21):
    if i == 0:
        print("ნულია")
    elif i % 2 == 0:
        print("ლუწია")
    else:
        print("კენტია")
# 8) შექმენი სია -> [5, 15, 25, 35, 45, 55] 
#    for ციკლით დაუარე სიას და დაბეჭდე მხოლოდ ის ელემენტები, რომლებიც იყოფა 5 ზე.
numbers = [5, 15, 25, 35, 45, 55]
for number in numbers:
    if number % 5 == 0:
        print(number)
# 9) მომხმარებელს შემოატანინე სიტყვა.  
#    for ციკლით დაბეჭდე ამ სიტყვის თითოეული ასო ცალცალკე.

# 10) შექმენი ცვლადი -> total = 0  
#     for ციკლით დაამატე 1 დან 10 მდე ყველა რიცხვი total-ში.  
#     ბოლოს დაბეჭდე -> "ჯამი არის: X".
user_word = input("შეიყვანეთ სიტყვა: ")
for letter in user_word:
    print(letter)