# 1) მომხმარებელს შემოატანინე სიტყვა ანდა ტექსტი.  
# -> გაიგე ამ სიტყვის/ტექსტის სიგრძე და დაპრინტე 
# -> for ციკლით დაბეჭდე ამ სიტყვის თითოეული ასო ცალცალკე.



# sggg = input("please enter any text")

# lol = len(sggg)

# for i in range(lol):
#     print(sggg[i])

# 2)  შექმენით სია სადაც შეინახავთ სტრინგებს.
# დაუარეთ სიის თითოეულ ელემენტს:
# 1. დაპრინტეთ რამდენი სიმბოლოსაგან შედგება სიტყვა
# 2. თუ სიტყვის სიგრძე არის: 
# --> კენტი დაპრინტეთ 'კენტია'
# --> ლუწი დაპრინტეთ 'ლუწია'

lis = ["nika, datos, luka, aleqs"]
for word in lis:
    ttt = len(lis)

    print(f"'{lis}' - {ttt} სიმბოლო")

    if ttt % 2 != 0:
        print("კენტია")
    else:
        print("ლუწია")


